Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb.main must be replaced
-/+ resource "aws_alb" "main" {
      ~ arn                        = "arn:aws:elasticloadbalancing:us-west-2:713516755744:loadbalancer/app/tf-ecs-chat/b1283ee2b510e427" -> (known after apply)
      ~ arn_suffix                 = "app/tf-ecs-chat/b1283ee2b510e427" -> (known after apply)
      ~ dns_name                   = "tf-ecs-chat-1715458089.us-west-2.elb.amazonaws.com" -> (known after apply)
        enable_deletion_protection = false
        enable_http2               = true
      ~ id                         = "arn:aws:elasticloadbalancing:us-west-2:713516755744:loadbalancer/app/tf-ecs-chat/b1283ee2b510e427" -> (known after apply)
        idle_timeout               = 60
      ~ internal                   = false -> true # forces replacement
      ~ ip_address_type            = "ipv4" -> (known after apply)
        load_balancer_type         = "application"
        name                       = "tf-ecs-chat"
        security_groups            = [
            "sg-022ec051aaae56815",
        ]
        subnets                    = [
            "subnet-0833bb08c6735e0be",
            "subnet-089d961416a432598",
        ]
      - tags                       = {} -> null
      ~ vpc_id                     = "vpc-0ff182371eff87c50" -> (known after apply)
      ~ zone_id                    = "Z1H1FL5HABSF5" -> (known after apply)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0833bb08c6735e0be" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-089d961416a432598" -> null
        }
      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # aws_alb_listener.front_end must be replaced
-/+ resource "aws_alb_listener" "front_end" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-west-2:713516755744:listener/app/tf-ecs-chat/b1283ee2b510e427/761150fd85c38970" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-west-2:713516755744:listener/app/tf-ecs-chat/b1283ee2b510e427/761150fd85c38970" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-west-2:713516755744:loadbalancer/app/tf-ecs-chat/b1283ee2b510e427" -> (known after apply) # forces replacement
        port              = 80
        protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:713516755744:targetgroup/tf-ecs-chat/b07227a81cf8cb0e"
            type             = "forward"
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://cec34ed891f1:4141/lock?id=davejrt%252Fterraform-fargate-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
